app/Http/Middleware/ExpertiseCountMiddleware.php

    public function handle($request, Closure $next)
    {
        if (Auth::check()) {
            $user = Auth::user();

            // В работе
            $expertiseInWorkCount = Expertise::where(function ($query) use ($user) {
                $query->where('user_id', $user->id)
                      ->where('goverment_id', $user->government_id)
                      ->where('draft', '1');
            })->count();

            // На согласовании
            $expertisesAppCount = 0;
            if ($user->hasRole('ROLE_GO_EXPERTISE_CONFIRMER') ||
                $user->hasRole('ROLE_GO_EXPERTISE_EDITOR') ||
                $user->hasRole('ROLE_GO_EXPERTISE_SIGNER') ||
                $user->hasRole('ROLE_UO_EXPERTISE_CONFIRMER')) {

                $expertisesQuery = Expertise::join('expertise_role_status', 'expertise.id', '=', 'expertise_role_status.expertise_id')
                    ->where('expertise.goverment_id', $user->government_id)
                    ->where('expertise.send', '1')
                    ->where('expertise_role_status.approve', 1);

                if ($user->hasRole('ROLE_GO_EXPERTISE_CONFIRMER') || $user->hasRole('ROLE_UO_EXPERTISE_CONFIRMER')) {
                    $expertisesQuery->where('expertise_role_status.user_id', $user->id);
                }

                $expertisesAppCount = $expertisesQuery->count();
---
select count(*) as aggregate from `expertise` where (`user_id` = 128 and `goverment_id` = 24 and `draft` = '1')
select count(*) as aggregate from `expertise` inner join `expertise_role_status` on `expertise`.`id` = `expertise_role_status`.`expertise_id` where `expertise`.`goverment_id` = 1 and `expertise`.`send` = '1' and `expertise_role_status`.`approve` = 1 and `expertise_role_status`.`user_id` = 2951




                $expertiseGoExecutorCount = Expertise::where('expertise.send_to_uo_si', '1')
                ->where('expertise.send_to_uo_gts', '1')
                ->where('expertise.user_id', Auth::id())
                ->count();


                $executorCount = Expertise::join('expertise_role_status', 'expertise.id', '=', 'expertise_role_status.expertise_id')
                ->where(function ($query) use ($user) {
                    $query->where('expertise.send_to_si_reviewers', '1')
                          ->orWhere('expertise.send_to_gts_reviewers', '1');
                })
                ->where('expertise_role_status.user_id', $user->id)
                ->where('expertise_role_status.executor', 1)
                ->distinct()
                ->count();


                $approveConfirmersCount = Expertise::where(function ($query) use ($user) {
                    if ($user->hasRole('ROLE_KIB_EXPERTISE_CONFIRMER')) {
                        $query->where('send_to_kib', '1');
                            //   ->where('accept_kib_reviewers', '1');
                    } elseif ($user->hasRole('ROLE_SI_EXPERTISE_CONFIRMER')) {
                        $query->where('send_to_si', '1')
                              ->where('accept_si_reviewers', '1');
                    } else {
                        // If the user doesn't have the required role, don't display anything
                        $query->whereRaw('1=0');
                    }
                })->count();
---
select count(*) as aggregate from `expertise` where `expertise`.`send_to_uo_si` = '1' and `expertise`.`send_to_uo_gts` = '1' and `expertise`.`user_id` = 150
select count(*) as aggregate from `expertise` inner join `expertise_role_status` on `expertise`.`id` = `expertise_role_status`.`expertise_id` where (`expertise`.`send_to_si_reviewers` = '1' or `expertise`.`send_to_gts_reviewers` = '1') and `expertise_role_status`.`user_id` = 150 and `expertise_role_status`.`executor` = 1
select count(*) as aggregate from `expertise` where (1=0)