app/Http/Middleware/ExpertiseCountMiddleware.php




                $expertiseGoExecutorCount = Expertise::where('expertise.accept_go', '1')
                ->count();
---
select count(*) as aggregate from `expertise` where `expertise`.`accept_go` = '1'