<div class="container">

  <h3 class="geo__title" style="color: #004d7b;">Раздел 1 из 12</h3>
  <textarea id="editor_1" name="editor_1">
    <h1>Техническое задание</h1>
    <p><?php echo e($expertise->it_project->$names); ?></p>
    <p><b>Аннотация</b></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 2 из 12</h3>
  <textarea id="editor_2" name="editor_2">
    <h3>Раздел «Назначение и цели создания (развития) системы»</h3>
    <p><i>предупреждения и ликвидация чрезвычайных ситуаций</i></p>
    <p><b>2.1. Шифр темы или шифр (номер) договора</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>2.2. Наименование предприятий (объединений) разработчика и заказчика (пользователя) системы и их реквизиты</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>2.3. Перечень документов, на основании которых создается система, кем и когда утверждены эти документы</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>2.4. Плановые сроки начала и окончания работы по созданию системы</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>2.5. Сведения об источниках и порядке финансирования работ</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>2.6. Список используемых сокращений</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 3 из 12</h3>
  <textarea id="editor_3" name="editor_3">
    <h3>Раздел «Характеристика объектов автоматизации»</h3>
    <p><b>3.1. Краткое описание технологического процесса или производства с приведением основных технологических характеристик и особенностей процесса или производства  (ссылки на документы, содержащие такую информацию)</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.2. Сведения о задачах и функциях, решаемых в практике управления</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.3. Описание технологического процесса или производства (технической системы) как объекта управления. Дается описание статических и динамических характеристик объекта и их влияние на технико-экономические показатели, а также особенности свойственные данному объекту</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.4. Сведения о существующей практике контроля и управления</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.5. Сведения о  технических, информационных и математических средствах и методах используемых на практике</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.6. Сведения о достоинствах и недостатках существующей практики управления</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.6. Сведения об условиях эксплуатации объекта автоматизации и характеристиках окружающей среды</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>3.6. Описание предлагаемой структуры технического, информационного и математического обеспечения</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 4 из 12</h3>
  <textarea id="editor_4" name="editor_4">
    <h3>Подраздел «Требования к системе в целом» раздела «Требования к системе»</h3>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 5 из 12</h3>
  <textarea id="editor_5" name="editor_5">
    <p><b>5.1. Требования к структуре и функционированию системы</b></p>
    <ul>
      <li>перечень подсистем, их назначение и основные характеристики, требования к числу уровней иерархии и степени централизации системы;</li>
      <li>требования к способам и средствам связи для информационного обмена между компонентами системы;</li>
      <li>требования к характеристикам взаимосвязей создаваемой системы со смежными системами, требования к ее совместимости, в том числе указания о способах обмена информацией (автоматически, пересылкой документов, по телефону и т. п.);</li>
      <li>требования к безопасности структуры системы;</li>
      <li>требования к режимам функционирования системы;</li>
      <li>требования по диагностированию системы;</li>
      <li>перспективы развития, модернизации системы.</li>
    </ul>
    <p><b>5.2. Требования к надежности</b></p>
    <ul>
      <li>состав и количественные значения показателей надежности для системы в целом или ее подсистем;</li>
      <li>перечень аварийных ситуаций, по которым должны быть регламентированы требования к надежности, и значения соответствующих показателей;</li>
      <li>требования к надежности технических средств и программного обеспечения;</li>
      <li>требования к методам оценки и контроля показателей надежности на разных стадиях создания системы в соответствии с действующими нормативно-техническими документами.</li>
    </ul>
    <p><b>5.3. Требования безопасности</b></p>
    <ul>
      <li>требования по обеспечению безопасности при монтаже, наладке, эксплуатации, обслуживании и ремонте технических средств системы (защита от воздействий электрического тока, электромагнитных полей, акустических шумов и т. п.), по допустимым уровням освещенности, вибрационных и шумовых нагрузок.</li>
    </ul>
    <p><b>5.4. Требования к численности и квалификации персонала системы и режиму его работы:</b></p>
    <ul>
      <li>требования к численности персонала (пользователей) АС;</li>
      <li>требования к квалификации персонала, порядку его подготовки и контроля знаний и навыков;</li>
      <li>требуемый режим работы персонала АС.</li>
    </ul>

    <p><b>5.5. Требования к показателям назначения АС</b></p>
    <ul>
      <li>приводятся значения параметров, характеризующие степень соответствия системы ее назначению.</li>
      <li>указывают: степень приспособляемости системы к изменению процессов и методов управления, к отклонениям параметров объекта управления; допустимые пределы модернизации и развития системы; вероятностно-временные характеристики, при которых сохраняется целевое назначение системы.</li>
    </ul>

    <p><b>5.6. Требования к эргономике и технической эстетике</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>5.7. Требования к эксплуатации, техническому обслуживанию, ремонту и хранению компонентов системы</b></p>
    <ul>
      <li>условия и регламент (режим) эксплуатации, которые должны обеспечивать использование технических средств (ТС) системы с заданными техническими показателями, в том числе виды и периодичность обслуживания ТС системы или допустимость работы без обслуживания;</li>
      <li>предварительные требования к допустимым площадям для размещения персонала и ТС системы, к параметрам сетей энергоснабжения и т. п.;</li>
      <li>требования по количеству, квалификации обслуживающего персонала и режимам его работы;</li>
      <li>требования к составу, размещению и условиям хранения комплекта запасных изделий и приборов;</li>
      <li>требования к регламенту обслуживания.</li>
    </ul>

    <p><b>5.8. Требования к защите информации от несанкционированного доступа</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>5.9. Требования по сохранности информации при авариях</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>5.10. Требования к защите от влияния внешних воздействий</b></p>
    <ul>
      <li>требования к радиоэлектронной защите средств АС;</li>
      <li>требования по стойкости, устойчивости и прочности к внешним воздействиям (среде применения).</li>
    </ul>

    <p><b>5.11. Требования к патентной чистоте</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>5.12. Требования по стандартизации и унификации</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 6 из 12</h3>
  <textarea id="editor_6" name="editor_6">
    <h3>Подраздел «Требование к функциям (задачам)» раздела «Требования к системе»</h3>
    <p><b>6.1. Привести по каждой подсистеме перечень функций, задач или их комплексов, подлежащих автоматизации</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>6.2. При создании системы в две или более очереди - перечень функциональных подсистем, отдельных функций или задач, вводимых в действие в 1-й и последующих очередях</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>6.3. Временной регламент реализации каждой функции, задачи (или комплекса задач)</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>6.4. Требования к форме представления выходной информации, к качеству реализации исполнения каждой функции (задачи или комплекса задач), характеристики необходимой точности и времени выполнения, требования одновременности выполнения группы функций, достоверности выдачи результатов</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>6.5. Перечень и критерии отказов для каждой функции, по которой задаются требования по надежности</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 7 из 12</h3>
  <textarea id="editor_7" name="editor_7">
    <h3>Подраздел «Требования к видам обеспечения» раздела «Требования к системе»</h3>
    <p><b>7.1. Требование к математическому обеспечению</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>7.2. Требование к информационному обеспечению</b></p>
    <ul>
      <li>требования к составу, структуре и способам организации данных в системе;
      <li>требования к информационному обмену между компонентами системы;
      <li>требования к информационной совместимости со смежными системами;
      <li>требования по применению систем управления базами данных;
      <li>требования к структуре процесса сбора, обработки, передачи данных в системе и представлению данных;
      <li>требования к защите данных;
      <li>требования к контролю, хранению, обновлению и восстановлению данных
    </ul>
    <p><b>7.3. Требование к лингвистическому обеспечению </b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>7.4. Требование к программному обеспечению</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>7.5. Требование к техническому обеспечению</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>7.6. Требование к метрологическому обеспечению</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>7.7. Требование к организационному, методическому и другим видам обеспечения системы</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 8 из 12</h3>
  <textarea id="editor_8" name="editor_8">
    <h3>Раздел «Состав и содержание работ по созданию системы»</h3>
    <p><b>8.1. Перечень стадий и этапов работ по созданию системы в соответствии с ГОСТ 34.601, сроки их выполнения, перечень организаций - исполнителей работ, ссылки на документы, подтверждающие согласие этих организаций на участие в создании системы, или запись, определяющую ответственного (заказчик или разработчик) за проведение этих работ</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>8.2. Перечень документов, предъявляемых по окончании соответствующих стадий и этапов работ</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>8.3. Вид и порядок проведения экспертизы технической документации (стадия, этап, объем проверяемой документации, организация-эксперт)</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>8.4. Программа работ, направленных на обеспечение требуемого уровня надежности разрабатываемой системы (при необходимости)</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>8.5. Перечень работ по метрологическому обеспечению на всех стадиях создания системы с указанием их сроков выполнения и организаций-исполнителей (при необходимости)</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 9 из 12</h3>
  <textarea id="editor_9" name="editor_9">
    <h3>Раздел «Порядок контроля и приемки системы»</h3>
    <p><b>9.1. В процессе верификации должны проверяться следующие условия:</b></p>
    <ol>
      <li>непротиворечивость требований к системе и степень учета потребностей пользователей;
      <li>возможности поставщика выполнять заданные требования;
      <li>корректность описания в проектных спецификациях входных и выходных данных, последовательности событий, интерфейсов, логики и т.д.;
      <li>соответствие кода проектным спецификациям и требованиям;
      <li>тестируемость и корректность кода, его соответствие принятым стандартам кодирования;
      <li>корректность интеграция компонентов АС в единую систему;
      <li>адекватность, полнота и непротиворечивость документации
    </ol>
    <p><b>9.2. Аттестация - полное соответствие АС спецификациям, требованиям и документации, представленной в ТЗ, а также возможность его безопасного и надежного применения пользователем</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>9.3. Совместная проверка - контроль планирования и управления ресурсами, персоналом, аппаратурой и инструментальными средствами проекта</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>9.4. Аудит - установления соответствия реальных работ и отчетов требованиям, планам и условиям договора</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>9.5. Разрешение проблем - анализ и решение проблем (включая обнаруженные несоответствия) независимо от их происхождения или источника, которые обнаружены в ходе разработки, эксплуатации, сопровождения или других процессов. Каждая обнаруженная проблема должна быть идентифицирована, описана, проанализирована и разрешена</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>9.6. Приемка работ по стадиям должна включать перечень участвующих предприятий и организаций, место и сроки проведения, порядок согласования и утверждения приемочной документации, а также статус приемочной комиссии (государственная, межведомственная, ведомственная и т.п.)</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 10 из 12</h3>
  <textarea id="editor_10" name="editor_10">
    <h3>Раздел «Требования к составу и содержанию работ по подготовке объекта автоматизации к вводу системы в действие»</h3>
    <p><b>10.1. Приведение поступающей в систему информации (в соответствии с требованиями к информационному и лингвистическому обеспечению) к виду, пригодному для обработки с помощью ЭВМ</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>10.2. Изменения, которые необходимо осуществить в объекте автоматизации</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>10.3. Создание условий функционирования объекта автоматизации, при которых гарантируется соответствие создаваемой системы требованиям, содержащимся в ТЗ</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>10.4. Создание необходимых для функционирования системы подразделений и служб</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>10.5. Сроки и порядок комплектования штатов и обучения персонала</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 11 из 12</h3>
  <textarea id="editor_11" name="editor_11">
    <h3>Раздел «Требования к документированию»</h3>
    <p><b>11.1. Согласованный разработчиком и заказчиком системы перечень подлежащих разработке комплектов и видов документов, соответствующих требованиям НТД отрасли заказчика</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>11.2. Перечень документов, выпускаемых на машинных носителях</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>11.3. Требования по документированию комплектующих элементов межотраслевого применения в соответствии с требованиями ЕСКД и ЕСПД</b></p>
    <p><i>развернутый ответ</i></p>
    <p><b>11.4. При отсутствии государственных стандартов, определяющих требования к документированию элементов системы, дополнительно включают требования к составу и содержанию таких документов</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>

  <p><br></p>
  <h3 class="geo__title" style="color: #004d7b;">Раздел 12 из 12</h3>
  <textarea id="editor_12" name="editor_12">
    <h3>Раздел «Источники разработки»</h3>
    <p><b>12.1. Должны быть перечислены документы и информационные материалы (технико-экономическое обоснование, отчеты о законченных научно-исследовательских работах, информационные материалы на отечественные, зарубежные системы-аналоги и др.), на основании которых разрабатывалось ТЗ и которые должны быть использованы при создании системы</b></p>
    <p><i>развернутый ответ</i></p>
  </textarea>
  <br>
</div><?php /**PATH C:\Users\user\Documents\НОВЫЙ ПОРТАЛ\www\resources\views/expertise/tabs_data/tz.blade.php ENDPATH**/ ?>