app/Http/Controllers/AdministratorController.php

    public function index()
    {
        if (Auth::user()->government_id == 108) {

            $governments = Government::get();
            $users_count = User::count();
            $passports_count = Passport::count();
            $uchet_count = InformationSystem::where('status', 0)->where('send', 1)->count();

            $users = User::orderBy('created_at', 'desc')->paginate(50);
---
select * from `governments`
select count(*) as aggregate from `users`
select count(*) as aggregate from `passports`
select count(*) as aggregate from `information_systems` where `status` = 0 and `send` = 1
select * from `users` order by `created_at` desc limit 50 offset 0

    public function edit($id)
    {
        if (Auth::user()->government_id == 108) {

            $users_count = User::count();
            $passports_count = Passport::count();
            $uchet_count = InformationSystem::where('status', 0)->where('send', 1)->count();
            $governments = Government::get();

            $user_data = User::where('id', $id)->first();
            $roles = Role::all();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `passports`
select count(*) as aggregate from `information_systems` where `status` = 0 and `send` = 1
select * from `governments`
select * from `users` where `id` = '2958' limit 1
select * from `roles`