app/Http/Controllers/ExpertisesController.php

insert into `expertise` (`user_id`, `goverment_id`, `it_project_id`, `type_project`, `version_expertise`, `updated_at`, `created_at`) values (2950, 1, '34', '4', '0', '2024-06-27 18:04:37', '2024-06-27 18:04:37')
select * from `expertise` where `id` = 1 limit 1
select * from `information_systems` where `goverment_id` = 1
select * from `users`
select * from `expertise` where `id` = 1
---
            //if ( $chectExpertise >= 0 ) {
            if ( $chectExpertise == 0 ) {

                $addExpertise = Expertise::create([
                    'user_id' => Auth::user()->id,
                    'goverment_id' => Auth::user()->government_id,
                    'it_project_id' => $request->it_project,
                    'type_project' => $request->project_type,
                    'version_expertise' => '0'
                ]);

                // $addExpertise->id  -  это ID последней записи в базу, добавленной запросом выше

                $expertise = Expertise::where('id', $addExpertise->id)->first();
                $iss = InformationSystem::where('goverment_id', Auth::user()->government_id)->get();
                $users = User::all();
                $versions = Expertise::where('id', $expertise->id)->get();

select * from `expertise` order by `created_at` desc limit 1
---
                'address_customer' => $request->address_customer,
                'list_docs' => $request->list_docs,
                'dates_start_end' => $request->dates_start_end,
                'finanсes' => $request->finanсes,
                'is_appointment' => $request->is_appointment,
                'is_target' => $request->is_target,
                'type_ntd' => $request->type_ntd,
                'basis_development' => $request->basis_development,
                'links' => $request->links,
                'build_year' => $request->build_year,
                'gosproject' => $request->gosproject,
                'sostav' => $request->sostav,
                'modules' => $request->modules,
                'po' => $request->po,
                'hosting' => $request->hosting,
                'selected_is_for_change' => $request->selected_is_for_change,
                'selected_is_for_exit' => $request->selected_is_for_exit,
                'paln_integrations' => $request->paln_integrations,
                'documents_list' => json_encode($ID_File),
                'version_expertise' => '1',
                'draft' => '1',
                'send' => '0',
                'comment_accept' => $request->comment
            ]);

select * from `expertise` order by `created_at` desc limit 1
---


            // $expertiseId = Expertise::latest()->first()->id;
            $expertise = Expertise::latest()->first();

insert into `expertise_role_status` (`user_id`, `expertise_id`, `approve`, `updated_at`, `created_at`) values ('2951', '2', 1, '2024-06-18 14:53:56', '2024-06-18 14:53:56')
insert into `expertise_role_status` (`user_id`, `expertise_id`, `signing`, `updated_at`, `created_at`) values ('2952', '2', 1, '2024-06-18 14:53:56', '2024-06-18 14:53:56')
---


            // Создание записи в таблице ExpertiseRoleStatus для согласующего
            $expertiseRoleStatusApprover1 = ExpertiseRoleStatus::create([
                'user_id' => isset($selectedApproverId1) ? $selectedApproverId1 : 0,
                'expertise_id' => $request->expertise_id,
                'approve' => ($selectedApproverId1 != null),
            ]);

            // Создание Roleзаписи в таблице ExpeRolertiseRoleStatus для подписанта
            $expertiseRoleStatusSigner = ExpertiseRoleStatus::create([
                'user_id' => $selectedSignerId,
                'expertise_id' => $request->expertise_id,
                'signing' => ($selectedSignerId != null)
            ]);

select max(`version`) as aggregate from `expertise_documents` where `expertise_id` = '2'
---
            /* ШАГ 2. Обновление или загрузка файла */
            $uploadedFile = $request->file('doc_file');
            if (!empty($uploadedFile)) {
                $lastVersionNumber = ExpertiseDocument::where('expertise_id', $request->expertise_id)->max('version');

insert into `expertise_documents` (`user_id`, `government_id`, `it_project_id`, `type_project`, `expertise_id`, `version`, `doc_status`, `doc_lang`, `doc_type`, `doc_version`, `doc_year`, `doc_name`, `file_name`, `file_name_upload`, `file_type`, `file_size`, `updated_at`, `created_at`) values (2950, 1, '33', '4', '2', 1, 'project', 'comb', '4 Новый IT-проект 2', '4 Новый IT-проект 2', '2029', '4 Новый IT-проект 2', 'mysql.txt', 'userfiles/expertisefile/DdWa48n9R6WsIrrm5OMFmI9HxvB8m05rLQVDk98K.txt', 'text/plain', 351333, '2024-06-06 17:27:09', '2024-06-06 17:27:09')
---
                $file_name = $request->file('doc_file')->getClientOriginalName();
                $file_type = $uploadedFile->getMimeType();
                $file_size = $uploadedFile->getSize();
                $addFile = ExpertiseDocument::create([
                    'user_id' => Auth::user()->id,
                    'government_id' => Auth::user()->government_id,
                    'it_project_id' => $request->it_project_id,
                    'type_project' => $request->type_project,
                    'expertise_id' => $request->expertise_id,
                    // 'expertise_id' => $expertiseId,
                    'version' => $lastVersionNumber + 1,

                    'doc_status' => $request->doc_status,
                    'doc_lang' => $request->doc_lang,
                    'doc_type' => $request->doc_type,
                    'doc_version' => $request->doc_version,
                    'doc_year' => $request->doc_year,
                    'doc_name' => $request->doc_name,

                    'file_name' => $file_name,
                    'file_name_upload' => $file_upload,
                    'file_type' => $file_type,
                    'file_size' => $file_size
                ]);

insert into `expertise_documents` (`user_id`, `government_id`, `it_project_id`, `type_project`, `expertise_id`, `version`, `doc_status`, `doc_lang`, `doc_type`, `doc_version`, `doc_year`, `doc_name`, `file_name`, `file_name_upload`, `file_type`, `file_size`, `updated_at`, `created_at`) values (2950, 1, '32', '4', '2', 1, 'accepted', 'kz', 'Техническое задание «sadasd»', 'Техническое задание «sadasd»', '2027', 'Техническое задание «sadasd»', 'файл.xlsx', 'userfiles/expertisefile/MjCHIZ0MLcahVyLntLOrYDiWu6ZdHZwyG1sJIgRZ.bin', 'application/octet-stream', 6560, '2024-06-18 14:53:56', '2024-06-18 14:53:56')
---
                $file_name = $request->file('doc_file')->getClientOriginalName();
                $file_type = $uploadedFile->getMimeType();
                $file_size = $uploadedFile->getSize();
                $addFile = ExpertiseDocument::create([
                    'user_id' => Auth::user()->id,
                    'government_id' => Auth::user()->government_id,
                    'it_project_id' => $request->it_project_id,
                    'type_project' => $request->type_project,
                    'expertise_id' => $request->expertise_id,
                    // 'expertise_id' => $expertiseId,
                    'version' => 1,

                    'doc_status' => $request->doc_status,
                    'doc_lang' => $request->doc_lang,
                    'doc_type' => $request->doc_type,
                    'doc_version' => $request->doc_version,
                    'doc_year' => $request->doc_year,
                    'doc_name' => $request->doc_name,

                    'file_name' => $file_name,
                    'file_name_upload' => $file_upload,
                    'file_type' => $file_type,
                    'file_size' => $file_size
                ]);

select max(`version_expertise`) as aggregate from `expertise` where `id` = '2'
---


            /* ШАГ 3. запись данных в таблицу экспертизы */
                $VersionNumber = (int) Expertise::where('id', $request->expertise_id)->max('version_expertise');

select * from `expertise` where `expertise`.`id` = '2' limit 1
update `expertise` set `abbr` = 'Техническое задание «sadasd»', `num_poject` = 'Техническое задание «sadasd»', `company` = 'Техническое задание «sadasd»', `address` = 'Техническое задание «sadasd»', `сustomer` = 'Техническое задание «sadasd»', `address_customer` = 'Техническое задание «sadasd»', `list_docs` = 'Техническое задание «sadasd»', `dates_start_end` = 'Техническое задание «sadasd»', `finanсes` = 'Техническое задание «sadasd»', `is_appointment` = 'Техническое задание «sadasd»', `is_target` = 'Техническое задание «sadasd»', `type_ntd` = 'Техническое задание «sadasd»', `basis_development` = 'Техническое задание «sadasd»', `links` = 'Техническое задание «sadasd»', `build_year` = '2024', `gosproject` = 'Техническое задание «sadasd»', `sostav` = 'Техническое задание «sadasd»', `modules` = 'Техническое задание «sadasd»', `po` = 'Техническое задание «sadasd»', `hosting` = 'kt', `selected_is_for_change` = '1016', `selected_is_for_exit` = '1670', `paln_integrations` = 'Техническое задание «sadasd»', `version_expertise` = 1, `draft` = '0', `send` = '1', `comment_accept` = 'Техническое задание «sadasd»Техническое задание «sadasd»Техническое задание «sadasd»Техническое задание «sadasd»Техническое задание «sadasd»', `expertise`.`updated_at` = '2024-06-18 14:53:56' where `id` = 2
---
                }else{
                    $VersionNumber = 1;
                }
                $updateExpertise = Expertise::find($request->expertise_id);
                $updateExpertise->update([
                    'abbr' => $request->abbr,
                    'num_poject' => $request->num_poject,
                    'company' => $request->company,
                    'address' => $request->address,
                    'сustomer' => $request->сustomer,
                    'address_customer' => $request->address_customer,
                    'list_docs' => $request->list_docs,
                    'dates_start_end' => $request->dates_start_end,
                    'finanсes' => $request->finanсes,
                    'is_appointment' => $request->is_appointment,
                    'is_target' => $request->is_target,
                    'type_ntd' => $request->type_ntd,
                    'basis_development' => $request->basis_development,
                    'links' => $request->links,
                    'build_year' => $request->build_year,
                    'gosproject' => $request->gosproject,
                    'sostav' => $request->sostav,
                    'modules' => $request->modules,
                    'po' => $request->po,
                    'hosting' => $request->hosting,

select * from `it__projects` where `goverment_id` = 1
---
            // }
            /* Конец ШАГА 3. */

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();

select * from `expertise` where `expertise`.`id` = '1' limit 1
update `expertise` set `send` = 0, `go_approve` = 1, `send_to_go_signer` = 1, `expertise`.`updated_at` = '2024-06-21 15:31:40' where `id` = 1
---
            }
        }elseif ($request->has('approve_go')) {

            $updateExpertise = Expertise::find($request->expertise_id);
            $updateExpertise->update([
                'go_approve' => 1,
                'send' => 0,
                'send_to_go_signer' => 1
            ]);

insert into `expertise_role_status` (`user_id`, `expertise_id`, `executor`, `updated_at`, `created_at`) values ('150', '1', 1, '2024-06-27 18:16:12', '2024-06-27 18:16:12')
select * from `expertise` where `expertise`.`id` = '2' limit 1
update `expertise` set `send_to_si` = 0, `send_to_si_reviewers` = 1, `expertise`.`updated_at` = '2024-06-27 18:16:12' where `id` = 1
---
            // dd($expertiseId);

            // Создание записи в таблице ExpertiseRoleStatus для согласующего
            $expertiseRoleStatusApprover1 = ExpertiseRoleStatus::create([
                'user_id' => $selectedApproverId1,
                'expertise_id' => $expertiseId,
                'executor' => ($selectedApproverId1 != null),
            ]);

            $updateExpertise =Expertise::find($expertiseId);
            if ($updateExpertise) {
                $updateExpertise->send_to_si = 0;
                $updateExpertise->send_to_si_reviewers = 1;
                $updateExpertise->save();

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
            }
        }elseif( $request->has('create_and_send_to_dana') ) {
            /* ШАГ 3. запись данных в таблицу экспертизы */
            $updateExpertise = Expertise::find($request->expertise_id);

select * from `expertise` where `expertise`.`id` = '2' limit 1
update `expertise` set `send_to_uo` = 0, `send_to_uo_reviewer` = 1, `uo_reviewer` = '128', `comment_accept` = '', `expertise`.`updated_at` = '2024-06-25 17:32:20' where `id` = 2
---

        }elseif($request->has('send_to_uo_reviewer')){
            // Обновление данных в таблице Expertise
            $updateExpertise = Expertise::find($request->expertise_id);
            $updateExpertise->update([
                'send_to_uo_reviewer' => 1,
                'comment_accept' => $request->_comment,
                'send_to_uo' => 0,
                'uo_reviewer' => $request->send_to_mcriap_executor  // Используем переданный идентификатор исполнителя
            ]);

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
                'signing' => ($selectedSignerId != null),
            ]);
            // Обновление данных в таблице Expertise
            $updateExpertise = Expertise::find($request->expertise_id);

insert into `conclusion_si` (`expertise_id`, `user_id`, `expertise_version`, `concl_1`, `concl_2`, `concl_3`, `concl_4`, `concl_5`, `concl_6`, `concl_7`, `concl_8`, `concl_9`, `concl_10`, `concl_11`, `concl_12`, `concl_13`, `concl_14`, `concl_15`, `concl_16`, `concl_17`, `concl_18`, `concl_19`, `concl_20`, `concl_21`, `concl_22`, `concl_23`, `concl_24`, `concl_25`, `concl_26`, `concl_27`, `concl_28`, `concl_29`, `concl_30`, `concl_31`, `concl_32`, `concl_33`, `concl_34`, `concl_35`, `concl_36`, `concl_37`, `concl_38`, `concl_39`, `concl_40`, `concl_41`, `concl_42`, `concl_43`, `concl_44`, `concl_45`, `concl_46`, `concl_47`, `concl_48`, `concl_49`, `concl_50`, `concl_51`, `concl_52`, `concl_53`, `concl_54`, `concl_55`, `concl_56`, `concl_57`, `concl_58`, `concl_59`, `updated_at`, `created_at`) values ('', 150, 1, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2024-06-12 16:14:30', '2024-06-12 16:14:30')
---
                $expertiseConclusionSi->concl_58 = $request->concl_58;
                $expertiseConclusionSi->concl_59 = $request->concl_59;

                $expertiseConclusionSi->save();

select * from `it__projects` where `goverment_id` = 108
---


            /* Конец ШАГА 3. */
            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();

select * from `expertise` where `expertise`.`id` = '1' limit 1
---

            /* Конец ШАГА 3. */
            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Заключение сохранено');

select * from `expertise` where `expertise_id` = 266857
---
                }
            }
            // Обновление данных в таблице Expertise
            $updateExpertise = Expertise::find($request->expertise_id);

select * from `it__projects` where `goverment_id` = 1
select * from `users`
select * from `expertise` where `expertise`.`id` = '1' limit 1
---
                'accept_gts_reviewers' => '1',
            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Отправлен на согласование');

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Запрос согласован');

select * from `expertise` where `expertise`.`id` = '1' limit 1
---

            // Отклонение со стороны ЦПЦП (СИ)
            if ( Auth::user()->government_id == 108 ) {
                Expertise::find($request->expertise_id)->update([
                    'accept_cpcp' => 0,
                    'accept_cpcp_date' => NULL,
                    'discart_cpcp' => 1,
                    'discart_cpcp_date' => new DateTime(),
                    'comment_discart' => $request->_comment,
                    'comment_accept' => "",
                    'ecp_cpcp' => NULL,
                    'ecp_name_cpcp' => NULL,

                    'accept_mcriap' => 0,
                    'accept_mcriap_date' => NULL,
                    'discart_mcriap' => 0,
                    'discart_mcriap_date' => NULL,

                    'accept_gts' => 0,
                    'accept_gts_date' => NULL,
                    'discart_gts' => 0,
                    'discart_gts_date' => NULL,

                    'draft' => 1,

select * from `expertise` where `expertise`.`id` = '1' limit 1
---

            // Отклонение со стороны ГТС
            if ( Auth::user()->government_id == 114 ) {
                Expertise::find($request->expertise_id)->update([
                    'accept_gts' => 0,
                    'accept_gts_date' => NULL,
                    'discart_gts' => 1,
                    'discart_gts_date' => new DateTime(),
                    'comment_discart' => $request->_comment,
                    'comment_accept' => "",
                    'ecp_gts' => NULL,
                    'ecp_name_gts' => NULL,

                    'accept_mcriap' => 0,
                    'accept_mcriap_date' => NULL,
                    'discart_mcriap' => 0,
                    'discart_mcriap_date' => NULL,

                    'accept_cpcp' => 0,
                    'accept_cpcp_date' => NULL,
                    'discart_cpcp' => 0,
                    'discart_cpcp_date' => NULL,

                    'draft' => 1,
                    'send' => 0,

delete from `expertise_role_status` where `expertise_id` = '1'
select * from `expertise` where `expertise`.`id` = '1' limit 1
select * from `expertise` where `id` = '1' limit 1
select * from `technical_tasks` where `expertise_id` = '1' limit 1
select * from `expertise_documents` where `expertise_id` = '1' limit 1
---
        // Отклонение заявления на экспертизу сотрудником ГО
        }elseif ( $request->has('discart_uo_reviewer') ) {
            // Находим запись в таблице ExpertiseRoleStatus по expertise_id и удаляем ее
          ExpertiseRoleStatus::where('expertise_id', $request->expertise_id)->delete();

          // Обновляем запись в таблице Expertise
          Expertise::find($request->expertise_id)->update([
              'discart_uo_reviewer' => 1,
              'discart_uo_reviewer_date' => new DateTime(),
              'accept_go' => 0,
              'go_approve' => 0,
              'send_to_uo_reviewer' => 0,
              'uo_reviewer' => '',
              'accept_go_date' => NULL,
              'comment_discart' => $request->comment,
              'comment_accept' => "",
              'ecp' => '',
              'ecp_name_go' => '',
              'draft' => 1,
          ]);

          // Получаем необходимые данные для передачи в представление
          $expertise = Expertise::where('id', $request->expertise_id)->first();

          $tz = TechnicalTask::where('expertise_id', $request->expertise_id)->first();
          $document = ExpertiseDocument::where('expertise_id', $request->expertise_id)->first();

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
            $document = ExpertiseDocument::where('expertise_id', $request->expertise_id)->first();
            $conclusionsSi = ExpertiseConclutionSi::where('expertise_id', $request->expertise_id)->get();
            $conclusionsUo = ExpertiseConclutionUo::where('expertise_id', $request->expertise_id)->get();
            $conclusionsGts = ExpertiseConclutionGts::where('expertise_id', $request->expertise_id)->get();

select * from `it__projects` where `goverment_id` = 1
---
     } else {

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Запрос на экспертизу успешно создан');

select * from `it__projects` where `goverment_id` = 1
select * from `information_systems` where `goverment_id` = 1
select * from `users`
---
    public function edit($id)
{
    $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
    $iss = InformationSystem::where('goverment_id', Auth::user()->government_id)->get();
    $expertise = Expertise::
        where('id', $id)->
        where('user_id', Auth::user()->id)->
        where('goverment_id', Auth::user()->government_id)->
        where('draft', '1')->
        first();
    $tz = TechnicalTask::
        where('expertise_id', $id)->
        where('user_id', Auth::user()->id)->
        where('government_id', Auth::user()->government_id)->
        first();
    $document = ExpertiseDocument::
        where('expertise_id', $id)->
        where('user_id', Auth::user()->id)->
        where('government_id', Auth::user()->government_id)->
        first();
    $users = User::all();

select * from `expertise` where `expertise`.`id` = '3' limit 1
---
public function createNewVersion($id){
        $expertise = Expertise::findOrFail($id);
        // dd($expertise);

        $newVersion = null;

        // Получаем текущую последнюю версию
        $lastVersionNumber = Expertise::where('id', $expertise->id)->max('version_expertise');

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
    public function destroy($id)
    {
        $expertise = Expertise::findOrFail($id);

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
    public function info($id)
    {
        if ( Auth::user()->government_id == 24 || Auth::user()->government_id == 114 || Auth::user()->government_id == 108 ) {

            $expertise = Expertise::where('id', $id)->first();

select * from `governments`
---
public function approve_confirmers(){
    $user = Auth::user();
    $govs = Government::all();

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
    public function approve_signecp(Request $request)
    {
        if ($request->ajax()) {

            $issuerCn = $request->_verify['issuerCn'];
            $authorityKeyIdentifier = $request->_verify['authorityKeyIdentifier'];
            $serialNumber = $request->_verify['serialNumber'];

            $subjectCn = $request->_verify['subjectCn'];


            Expertise::find($request->_expertise_id)->update([
                'discart_go' => 0,
                'discart_go_date' => NULL,
                'accept_go' => 1,
                'accept_go_date' => new DateTime(),
                'comment_discart' => "",
                'comment_accept' => $request->_comment,
                // 'send_to_si' => $request->send_to_si,
                // 'send_to_kib' => $request->send_to_kib,
                // 'send_to_mcriap_executor' => $request->send_to_mcriap_executor,
                // 'send_to_uo' => 0,
                // 'send_to_si' => 1,
                // 'send_to_kib' => 1,
                // 'send_to_mcriap_executor' => 1,
                'ecp_name_go' => $subjectCn,
                'ecp' => $issuerCn . ", " . $authorityKeyIdentifier . ", " . $serialNumber
            ]);

select * from `governments`
---
public function outbox(){

    $govs = Government::all();

select * from `governments`
---
public function signer_outbox(){

    $govs = Government::all();

select * from `governments`
select * from `expertise` where `expertise`.`id` = '1' limit 1
select count(*) as aggregate from `expertise` where (`user_id` = 2953 and `goverment_id` = 114 and `draft` = '1') or `send_to_go_fromUo` = '1'
---
public function draft()
{
    $govs = Government::all();
    $expertises = Expertise::where(function ($query) {
        $query->where('user_id', Auth::user()->id)
              ->where('goverment_id', Auth::user()->government_id)
              ->where('draft', '1');
    })
    // ->orWhere('send_to_go_fromUo', '1')
      ->orderBy('id', 'desc')
      ->paginate(10);

    $expertiseCount = Expertise::where(function ($query) {
        $query->where('user_id', Auth::user()->id)
              ->where('goverment_id', Auth::user()->government_id)
              ->where('draft', '1');
    })->orWhere('send_to_go_fromUo', '1')
      ->count();

select * from `governments`
select count(*) as aggregate from `expertise` where `send_to_gts` = '1'
select * from `expertise` where `send_to_gts` = '1' order by `id` desc limit 10 offset 0
---
public function in_work() {
        $user = Auth::user();
        $govs = Government::all();

        $expertisesQuery = Expertise::query();

        if ($user->hasRole('ROLE_UO_EXPERTISE_REVIEWER')) {
            $expertisesQuery->where(function($query) {
                $query->where('send_to_uo_reviewer', '1')
                    ->orWhere('accept_uo_reviewer', '1');
            });
        } elseif ($user->hasRole('ROLE_KIB_EXPERTISE_EXECUTOR')) {
            $expertisesQuery->where('send_to_kib', '1');
        } elseif ($user->hasRole('ROLE_SI_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_si', '1')
            ->where('send_to_si_reviewers', '0')
            ->where('accept_si_reviewers', '0');
        } elseif ($user->hasRole('ROLE_GTS_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_gts', '1');
        } elseif ($user->hasRole('ROLE_UO_EXPERTISE_DANA')) {
            $expertisesQuery->where('send_to_uo', '1');
        } else {
            // Если у пользователя нет соответствующей роли, не отображаем ничего
            $expertisesQuery->whereRaw('1=0');
        }

        $expertisesCount = $expertisesQuery->count();
        $expertises = $expertisesQuery->orderBy('id', 'desc')->paginate(10);

select * from `governments`
---
    public function got_job(){
        $govs = Government::all();

select * from `governments`
select * from `expertise` where `send_to_gts` = '1' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `expertise` where `send_to_gts` = '1'
---
public function executor(){

    $govs = Government::all();
    $expertises = Expertise::join('expertise_role_status', 'expertise.id', '=', 'expertise_role_status.expertise_id')
    ->select('expertise.*')
    ->where('expertise.send_to_si_reviewers', '1')
    ->where('expertise_role_status.user_id', Auth::id())
    ->where('expertise_role_status.executor', 1)
    ->orWhere(function($query) {
        $query->where('expertise.send_to_gts_reviewers', '1')
              ->where('expertise_role_status.user_id', Auth::id())
              ->where('expertise_role_status.executor', 1);
    })
    ->distinct() // Добавляем этот метод для удаления дубликатов
    ->orderBy('expertise.id', 'desc')
    ->paginate(10);

select * from `governments`
---
public function goExecutor() {
    $govs = Government::all();

select * from `expertise` where `expertise`.`id` = '2' limit 1
update `expertise` set `ecp_gts_reviewers` = 'ҰЛТТЫҚ КУӘЛАНДЫРУШЫ ОРТАЛЫҚ (RSA), 5b6a7411, 55b355a25bafb2f14da6f39952f9f22b87fc691f', `ecp_name_gts_reviewers` = 'АЛПАМЫС АҚЖОЛ', `expertise`.`updated_at` = '2024-06-25 18:08:41' where `id` = 2
---
    public function accept_gts_reviewer(Request $request) {
        if ($request->ajax()) {

            $issuerCn = $request->_verify['issuerCn'];
            $authorityKeyIdentifier = $request->_verify['authorityKeyIdentifier'];
            $serialNumber = $request->_verify['serialNumber'];
            $subjectCn = $request->_verify['subjectCn'];

            Expertise::find($request->expertise_id)->update([
                'ecp_gts_reviewers' => $issuerCn . ", " . $authorityKeyIdentifier . ", " . $serialNumber,
                'ecp_name_gts_reviewers' => $subjectCn,
            ]);

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
    public function accept_uo_confirmer(Request $request) {
        if ($request->ajax()) {

            $issuerCn = $request->_verify['issuerCn'];
            $authorityKeyIdentifier = $request->_verify['authorityKeyIdentifier'];
            $serialNumber = $request->_verify['serialNumber'];
            $subjectCn = $request->_verify['subjectCn'];

            Expertise::find($request->expertise_id)->update([
                'ecp_uo_confirmer' => $issuerCn . ", " . $authorityKeyIdentifier . ", " . $serialNumber,
                'ecp_name_uo_confirmer' => $subjectCn,
            ]);