app/Http/Controllers/ExpertisesController.php

                'accept_gts_reviewers' => '1',
            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
---
select * from `it__projects` where `goverment_id` = 114

            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Отправлен на согласование');
---
select * from `users`

    public function edit($id)
    {
        $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
        $iss = InformationSystem::where('goverment_id', Auth::user()->government_id)->get();
        $expertise = Expertise::
            where('id', $id)->
            where('user_id', Auth::user()->id)->
            where('goverment_id', Auth::user()->government_id)->
            where('draft', '1')->
            orWhere('send_to_go_fromUo', '1')->
            first();
        $tz = TechnicalTask::
            where('expertise_id', $id)->
            where('user_id', Auth::user()->id)->
            where('government_id', Auth::user()->government_id)->
            first();
        $document = ExpertiseDocument::
            where('expertise_id', $id)->
            where('user_id', Auth::user()->id)->
            where('government_id', Auth::user()->government_id)->
            first();
        $users = User::all();
---
select * from `information_systems` where `goverment_id` = 1
select * from `users`

    public function createNewVersion($id)
    {
        $expertise = Expertise::findOrFail($id);

        $newVersion = null;

        // DB::transaction(function () use ($expertise, &$newVersion) {
                // Получаем текущую последнюю версию
                $lastVersionNumber = Expertise::where('id', $expertise->id)->max('version_expertise');
---
select * from `expertise` where `expertise`.`id` = '1' limit 1

public function approve_info($id, $version_id = null)
{
    $expertise = Expertise::findOrFail($id);
    $current_version = $expertise -> version_expertise;
    // dd((int) $current_version, (int) $version_id);
    // $ef = (int) $current_version > (int) $version_id;
    // dd($ef);

    if ((int) $current_version > (int) $version_id) {
        // Выборка из обеих моделей, если версия больше предыдущей
        $version = ExpertiseVersion::where('expertise_id', $id)->where('version_number', $version_id)->firstOrFail();
    } else {
        $version = Expertise::where('id', $id)->where('version_expertise', $version_id)->firstOrFail();
        // Выборка только из модели Expertise, если версия равна 1
    }


    $tz = TechnicalTask::where('expertise_id', $id)->where('version', $version_id)->first();
    $document = ExpertiseDocument::where('expertise_id', $id)->where('version', $version_id)->first();
---
select * from `expertise` where `id` = '1' and `version_expertise` = '1' limit 1
select * from `technical_tasks` where `expertise_id` = '1' and `version` = '1' limit 1
select * from `expertise_documents` where `expertise_id` = '1' and `version` = '1' limit 1

    public function in_work() {
        $user = Auth::user();
        $govs = Government::all();

        $expertisesQuery = Expertise::query();

        if ($user->hasRole('ROLE_UO_EXPERTISE_REVIEWER')) {
            $expertisesQuery->where(function($query) {
                $query->where('send_to_uo_reviewer', '1')
                    ->orWhere('accept_uo_reviewer', '1');
            });
        } elseif ($user->hasRole('ROLE_KIB_EXPERTISE_EXECUTOR')) {
            $expertisesQuery->where('send_to_kib', '1');
        } elseif ($user->hasRole('ROLE_SI_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_si', '1');
        } elseif ($user->hasRole('ROLE_GTS_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_gts', '1');
        } elseif ($user->hasRole('ROLE_UO_EXPERTISE_DANA')) {
            $expertisesQuery->where('send_to_uo', '1');
        } else {
            // Если у пользователя нет соответствующей роли, не отображаем ничего
            $expertisesQuery->whereRaw('1=0');
        }

        $expertisesCount = $expertisesQuery->count();
        $expertises = $expertisesQuery->orderBy('id', 'desc')->paginate(10);
---
select * from `governments`
select count(*) as aggregate from `expertise` where 1=0

    public function executor(){

    $govs = Government::all();
    $expertises = Expertise::join('expertise_role_status', 'expertise.id', '=', 'expertise_role_status.expertise_id')
    ->select('expertise.*')
    ->where('expertise.send_to_si_reviewers', '1')
    ->where('expertise_role_status.user_id', Auth::id())
    ->where('expertise_role_status.executor', 1)
    ->orWhere(function($query) {
        $query->where('expertise.send_to_gts_reviewers', '1')
              ->where('expertise_role_status.user_id', Auth::id())
              ->where('expertise_role_status.executor', 1);
    })
    ->orderBy('expertise.id', 'desc')
    ->paginate(10);
---
select * from `governments`
select `expertise`.* from `expertise` inner join `expertise_role_status` on `expertise`.`id` = `expertise_role_status`.`expertise_id` where `expertise`.`send_to_si_reviewers` = '1' and `expertise_role_status`.`user_id` = 150 and `expertise_role_status`.`executor` = 1 or (`expertise`.`send_to_gts_reviewers` = '1' and `expertise_role_status`.`user_id` = 150 and `expertise_role_status`.`executor` = 1) order by `expertise`.`id` desc limit 10 offset 0
select count(*) as aggregate from `expertise` inner join `expertise_role_status` on `expertise`.`id` = `expertise_role_status`.`expertise_id` where `expertise`.`send_to_si_reviewers` = '1' and `expertise_role_status`.`user_id` = 150 and `expertise_role_status`.`executor` = 1 or (`expertise`.`send_to_gts_reviewers` = '1' and `expertise_role_status`.`user_id` = 150 and `expertise_role_status`.`executor` = 1)

    public function accept_gts_confirmer(Request $request) {
        if ($request->ajax()) {

            $issuerCn = $request->_verify['issuerCn'];
            $authorityKeyIdentifier = $request->_verify['authorityKeyIdentifier'];
            $serialNumber = $request->_verify['serialNumber'];
            $subjectCn = $request->_verify['subjectCn'];

            Expertise::find($request->expertise_id)->update([
                'ecp_gts_confirmer' => $issuerCn . ", " . $authorityKeyIdentifier . ", " . $serialNumber,
                'ecp_name_gts_confirmer' => $subjectCn,
            ]);
---
select * from `expertise` where `expertise`.`id` = 1 limit 1