app/Http/Controllers/ExpertisesController.php

select * from `it__projects` where `goverment_id` = 1
---
    public function create()
    {
        $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();

select * from `it__projects` where `goverment_id` = 108
---
            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Согласован');

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
                }
            }
            // Обновление данных в таблице Expertise
            $updateExpertise = Expertise::find($request->expertise_id);

select * from `expertise` where `id` = '1' limit 1
---
            ]);

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Отправлен на согласование');

select * from `users`
---
     } else {

            $projects = It_Project::where('goverment_id', Auth::user()->government_id)->get();
            return View::make('expertise.create', [
                'projects' => $projects
            ])->with('successMsg', 'Запрос на экспертизу успешно создан');

select * from `expertise` where `id` = '1'
---
    public function destroy($id)
    {
        $expertise = Expertise::findOrFail($id);

select * from `governments`
---
    public function create_it_project()
    {
        $govs = Government::all();

select * from `expertise` where `id` = '3'
---
    public function export(Request $request)
    {
        $expertise = Expertise::where('id', $request->_id)->first();

select * from `governments`
---
public function approve_confirmers(){
    $user = Auth::user();
    $govs = Government::all();

select * from `expertise` where `expertise`.`id` = '1' limit 1
select * from `technical_tasks` where `expertise_id` = '1' and `version` = '1' limit 1
select * from `technical_tasks` where `expertise_id` = '2' and `version` = '1' limit 1
select * from `expertise_documents` where `expertise_id` = '2' and `version` = '1' limit 1
select * from `expertise_documents` where `expertise_id` = '1' and `version` = '1' limit 1
---
public function approve_info($id, $version_id = null)
{
    $expertise = Expertise::findOrFail($id);
    $expertise_id = $expertise -> expertise_id;

    // Получить нужную версию или самую последнюю, если не указана
    //  if ($version_id) {
    //     // $version = Expertise::where('expertise_id', $id)->where('version_expertise', $version_id)->firstOrFail();
    //     $version = Expertise::where('expertise_id', $expertise_id)->where('version_expertise', $version_id)->firstOrFail();
    //     } else {
    //         // $version = ExpertiseVersion::where('expertise_id', $id)->orderBy('version_expertise', 'desc')->first();
    //     $version = ExpertiseVersion::where('expertise_id', $id)->where('version_number', $version_id)->firstOrFail();
    //     }
    // dd($version_id);
    if ($version_id > 1) {
        // Выборка из обеих моделей, если версия больше предыдущей
        $version = Expertise::where('expertise_id', $expertise_id)->where('version_expertise', $version_id)->firstOrFail();
        // $version = ExpertiseVersion::where('expertise_id', $expertise_id)->where('version_number', $version_id)->firstOrFail();
    } else {
        // Выборка только из модели Expertise, если версия равна 1
        $version = Expertise::where('expertise_id', $expertise_id)->where('version_expertise', $version_id)->firstOrFail();
    }

    if ($version_id) {
        $tz = TechnicalTask::where('expertise_id', $id)->where('version', $version_id)->first();
    } else {
        $tz = TechnicalTask::where('expertise_id', $id)->first();
    }

    if ($version_id) {
        $document = ExpertiseDocument::where('expertise_id', $id)->where('version', $version_id)->first();
    } else {
        $document = ExpertiseDocument::where('expertise_id', $id)->first();

select * from `expertise` where `expertise`.`id` = '2' limit 1
---
    public function approve_signecp(Request $request)
    {
        if ($request->ajax()) {

            $issuerCn = $request->_verify['issuerCn'];
            $authorityKeyIdentifier = $request->_verify['authorityKeyIdentifier'];
            $serialNumber = $request->_verify['serialNumber'];

            $subjectCn = $request->_verify['subjectCn'];


            Expertise::find($request->_expertise_id)->update([
                'discart_go' => 0,
                'discart_go_date' => NULL,
                'accept_go' => 1,
                'accept_go_date' => new DateTime(),
                'comment_discart' => "",
                'comment_accept' => $request->_comment,
                // 'send_to_si' => $request->send_to_si,
                // 'send_to_kib' => $request->send_to_kib,
                // 'send_to_mcriap_executor' => $request->send_to_mcriap_executor,
                // 'send_to_uo' => 0,
                // 'send_to_si' => 1,
                // 'send_to_kib' => 1,
                // 'send_to_mcriap_executor' => 1,
                'ecp_name_go' => $subjectCn,
                'ecp' => $issuerCn . ", " . $authorityKeyIdentifier . ", " . $serialNumber
            ]);

select * from `expertise` where `expertise`.`id` = '1' limit 1
---
public function draft()
{
    $govs = Government::all();
    $expertises = Expertise::where(function ($query) {
        $query->where('user_id', Auth::user()->id)
              ->where('goverment_id', Auth::user()->government_id)
              ->where('draft', '1');
    })->orWhere('send_to_go_fromUo', '1')
      ->orderBy('id', 'desc')
      ->paginate(10);

    $expertiseCount = Expertise::where(function ($query) {
        $query->where('user_id', Auth::user()->id)
              ->where('goverment_id', Auth::user()->government_id)
              ->where('draft', '1');
    })->orWhere('send_to_go_fromUo', '1')
      ->count();

select * from `governments`
select count(*) as aggregate from `expertise` where `send_to_uo` = '1'
---
    public function in_work() {
        $user = Auth::user();
        $govs = Government::all();

        $expertisesQuery = Expertise::query();

        if ($user->hasRole('ROLE_UO_EXPERTISE_REVIEWER')) {
            $expertisesQuery->where(function($query) {
                $query->where('send_to_uo_reviewer', '1')
                    ->orWhere('accept_uo_reviewer', '1');
            });
        } elseif ($user->hasRole('ROLE_KIB_EXPERTISE_EXECUTOR')) {
            $expertisesQuery->where('send_to_kib', '1');
        } elseif ($user->hasRole('ROLE_SI_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_si', '1');
        } elseif ($user->hasRole('ROLE_GTS_EXPERTISE_CONFIRMER')) {
            $expertisesQuery->where('send_to_gts', '1');
        } elseif ($user->hasRole('ROLE_UO_EXPERTISE_DANA')) {
            $expertisesQuery->where('send_to_uo', '1');
        } else {
            // Если у пользователя нет соответствующей роли, не отображаем ничего
            $expertisesQuery->whereRaw('1=0');
        }

        $expertisesCount = $expertisesQuery->count();

select * from `governments`
---
    public function got_job(){
        $govs = Government::all();

select * from `governments`
---
    public function executor(){

    $govs = Government::all();