app/Models/ExpertiseVersion.php

select * from `information_systems` where `id` = '1016' limit 1
---
    public function getISS($id) {
        $iss = InformationSystem::where('id', $id)->first();